;Place localized text in this file
;you can copy/paste any other mods local text here and write your own
;as long as the [xxx yyy] remains the same you can replace whatever inbetween the " " marks for the line

[DisguiseVest X2EquipmentTemplate]
FriendlyName="Signal Jammer"
FriendlyNamePlural="Portable Signal Jammer"
BriefSummary="Instead of wearing a vest for physical protection, we could try to avoid detection in the first place and thus reduce physical contact. A compact electronic device that interferes with ADVENT tracking signals can be attached to the operative's torso to prevent our soldiers from being readily detected. Provides the Phantom ability."
TacticalText="<Bullet/> Grants no health bonus, but provides Phantom.\n<Bullet/> Only one armor enhancement can be equipped at a time.

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;ABB
[LightWeaponFragments X2ItemTemplate]
FriendlyName="Light Weapon Fragment"
FriendlyNamePlural="Light Weapon Fragments"
BriefSummary="Malfunctioning and broken weapons and weapon parts salvaged in the field and transported in storage crates. While we can't add them to our armory directly, these can still be broken down into weapon fragments and used as raw materials for improving our own rifle and shotgun designs."

[HeavyWeaponFragments X2ItemTemplate]
FriendlyName="Heavy Weapon Fragment"
FriendlyNamePlural="Heavy Weapon Fragments"
BriefSummary="Malfunctioning and broken weapons and weapon parts salvaged in the field and transported in high capacity storage crates. While we can't add them to our armory directly, these can still be broken down into weapon fragments and used as raw materials for improving our own cannon and sniper rifle designs."

[SidearmFragments X2ItemTemplate]
FriendlyName="Sidearm Fragment"
FriendlyNamePlural="Sidearm Fragments"
BriefSummary="Malfunctioning and broken weapons and weapon parts salvaged in the field and transported in light weight storage crates. While we can't add them to our armory directly, these can still be broken down into weapon fragments and used as raw materials for improving our own sidearm and melee weapon designs."

[TechFragments X2ItemTemplate]
FriendlyName="Tech Fragment"
FriendlyNamePlural="Tech Fragments"
BriefSummary="Malfunctioning and broken weapons and weapon parts salvaged in the field and transported in hermetically sealed storage crates. While we can't add them to our armory directly, these can still be broken down into weapon fragments and used as raw materials for improving our own tech weapon designs."

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;Half Life
[HalfLifeCrowbar_CV X2WeaponTemplate]
FriendlyName="Crowbar"
FriendlyNamePlural="Crowbars"
BriefSummary="Agent Freeman's signature weapon."
TacticalText="<Bullet/> The Freeman's signature weapon.\n<Bullet/>"
AbilityDescName="crowbarcrowbar"

[HalfLifeCrowbar_MG X2WeaponTemplate]
FriendlyName="Hardened Crowbar"
FriendlyNamePlural="Hardened Crowbars"
BriefSummary="Agent Freeman's signature weapon."
TacticalText="<Bullet/> The Freeman's signature weapon.\n<Bullet/>"
AbilityDescName="crowbar"

[HalfLifeCrowbar_BM X2WeaponTemplate]
FriendlyName="Tempered Crowbar"
FriendlyNamePlural="Tempered Crowbars"
BriefSummary="Agent Freeman's signature weapon."
TacticalText="<Bullet/> The Freeman's signature weapon.\n<Bullet/>"
AbilityDescName="crowbar"


[HalfLifePistol_CV X2WeaponTemplate]
FriendlyName="USP"
FriendlyNamePlural="USPs"
BriefSummary="The Heckler & Koch USP, donated by agent Freeman."
TacticalText="<Bullet/> The Heckler & Koch USP, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="pistol"

[HalfLifePistol_MG X2WeaponTemplate]
FriendlyName="Magnetic USP"
FriendlyNamePlural="Magetic USPs"
BriefSummary="The Heckler & Koch USP, donated by agent Freeman."
TacticalText="<Bullet/> The Heckler & Koch USP, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="pistol"

[HalfLifePistol_BM X2WeaponTemplate]
FriendlyName="Plasma USP"
FriendlyNamePlural="T3 HL USPs"
BriefSummary="The Heckler & Koch USP, donated by agent Freeman."
TacticalText="<Bullet/> The Heckler & Koch USP, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="pistol"


[HalfLifeRevolver_CV X2WeaponTemplate]
FriendlyName="Python"
FriendlyNamePlural="Pythons"
BriefSummary="The Colt Python, donated by agent Freeman."
TacticalText="<Bullet/> The Colt Python, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="revolver"

[HalfLifeRevolver_MG X2WeaponTemplate]
FriendlyName="Magetic Python"
FriendlyNamePlural="Magnetic Pythons"
BriefSummary="The Colt Python, donated by agent Freeman."
TacticalText="<Bullet/> The Colt Python, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="revolver"

[HalfLifeRevolver_BM X2WeaponTemplate]
FriendlyName="Plasma Python"
FriendlyNamePlural="Plasma Pythons"
BriefSummary="The Colt Python, donated by agent Freeman."
TacticalText="<Bullet/> The Colt Python, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="revolver"


[HalfLifeShotgun_CV X2WeaponTemplate]
FriendlyName="SPAS-12"
FriendlyNamePlural="SPAS-12s"
BriefSummary="The Franchi SPAS-12, donated by agent Freeman."
TacticalText="<Bullet/> The Franchi Spas-12, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="shotgun"

[HalfLifeShotgun_MG X2WeaponTemplate]
FriendlyName="Magnetic SPAS-12"
FriendlyNamePlural="Magnetic SPAS-12s"
BriefSummary="The Franchi SPAS-12, donated by agent Freeman."
TacticalText="<Bullet/> The Franchi SPAS-12, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="shotgun"

[HalfLifeShotgun_BM X2WeaponTemplate]
FriendlyName="Plasma SPAS-12"
FriendlyNamePlural="Plasma SPAS-12"
BriefSummary="The Franchi SPAS-12, donated by agent Freeman."
TacticalText="<Bullet/> The Franchi SPAS-12, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="shotgun"


[HalfLifeSMG_CV X2WeaponTemplate]
FriendlyName="MP7"
FriendlyNamePlural="MP7s"
BriefSummary="The Heckler & Koch MP7, donated by agent Freeman."
TacticalText="<Bullet/> The Heckler & Koch MP7, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="SMG"

[HalfLifeSMG_MG X2WeaponTemplate]
FriendlyName="Magnetic MP7"
FriendlyNamePlural="Magnetic MP7s"
BriefSummary="The Heckler & Koch MP7, donated by agent Freeman."
TacticalText="<Bullet/> The Heckler & Koch MP7, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="SMG"

[HalfLifeSMG_BM X2WeaponTemplate]
FriendlyName="Plasma MP7"
FriendlyNamePlural="Plasma MP7s"
BriefSummary="The Heckler & Koch MP7, donated by agent Freeman."
TacticalText="<Bullet/> The Heckler & Koch MP7, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="SMG"


[HalfLifeAR2_CV X2WeaponTemplate]
FriendlyName="AR2"
FriendlyNamePlural="AR2"
BriefSummary="The Combine AR2, donated by agent Freeman."
TacticalText="<Bullet/> The Combine AR2, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="AR2"

[HalfLifeAR2_MG X2WeaponTemplate]
FriendlyName="Magnetic AR2"
FriendlyNamePlural="Magnetic AR2"
BriefSummary="The Combine AR2, donated by agent Freeman."
TacticalText="<Bullet/> The Combine AR2, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="AR2"

[HalfLifeAR2_BM X2WeaponTemplate]
FriendlyName="Plasma AR2"
FriendlyNamePlural="Plasma AR2"
BriefSummary="The Combine AR2, donated by agent Freeman."
TacticalText="<Bullet/> The Combine AR2, donated by agent Freeman.\n<Bullet/>"
AbilityDescName="AR2"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;ZER0 SWORD
[Zero_CV X2WeaponTemplate]
FriendlyName="Zer0 Sword"
FriendlyNamePlural="Zer0 Swords"
BriefSummary="I disappear / A ghost admist the combat / Preparing to strike."
TacticalText="<Bullet/> I disappear / A ghost admist the combat / Preparing to strike.\n<Bullet/>"
AbilityDescName="sword"

[Zero_MG X2WeaponTemplate]
FriendlyName="Magnetic Zer0 Sword"
FriendlyNamePlural="Magnetic Zer0's Swords"
BriefSummary="I disappear / A ghost admist the combat / Preparing to strike."
TacticalText="<Bullet/> I disappear / A ghost admist the combat / Preparing to strike.\n<Bullet/>"
AbilityDescName="sword"

[Zero_BM X2WeaponTemplate]
FriendlyName="Plasma Zer0 Sword"
FriendlyNamePlural="Plasma Zer0's Swords"
BriefSummary="I disappear / A ghost admist the combat / Preparing to strike."
TacticalText="<Bullet/> I disappear / A ghost admist the combat / Preparing to strike.\n<Bullet/>"
AbilityDescName="sword"